Revit 2027 API
AssetPropertyFloat.Value Property
 The value of the property.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public float Value { get; set; }
Public Property Value As Single
	Get
	Set
public:
property float Value {
	float get ();
	void set (float value);
}
member Value : float32 with get, set
Property Value
Single
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The input value is invalid for this AssetPropertyFloat property.
InvalidOperationException |  When setting this property: The asset property is not editable.
See Also
Reference
AssetPropertyFloat Class
Autodesk.Revit.DB.Visual Namespace